Repository: Rokongrelowiec/Studentifier
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Language
pl: Język

source: Chart
pl: Wykres

source: Hi
pl: Witaj

# guest
source: there
pl: osobo

source: Mode
pl: Tryb

source: Light
pl: Jasny

source: Dark
pl: Ciemny

source: System
pl: Systemowy

source: About the app
pl: O aplikacji

source: Gallery
pl: Galeria

source: Camera
pl: Kamera

source: Cancel
pl: Anuluj

source: Registered license plates
pl: Uprawnione rejestracje

source: Settings
pl: Ustawienia

source: Source code
pl: Kod źródłowy

source: Sing out
pl: Wyloguj się

# sing_out_msg
source: Are you sure you want to sing out?
pl: Czy na pewno chcesz się wylogować?

# fetch_failed
source: Sorry Could not fetch the data
pl: Przepraszamy Nie udało się pobrać danych

# last_month_visits
source: Visits in last month
pl: Wizyty w ostatnim miesiącu

source: Data Sheet
pl: Arkusz Danych

source: Most visits
pl: Najwięcej wizyt

source: Daily Report
pl: Dzienny Raport

source: Monthly Report
pl: Miesięczny Raport

source: License Plates
pl: Tablice Rejestracyjne

source: license plate
pl: rejestracja

source: Visits
pl: Wizyty

source: day
pl: dzień

source: Least visits
pl: Najmniej wizyt

# avg_per_day
source: Average of visits per day
pl: Średnia na dzień

source: Found
pl: Znaleziono

source: elements
pl: elementów

source: Index
pl: Indeks

# scan_name
source: Name
pl: Osoba

source: Lecturers
pl: Wykładowcy

source: Removed
pl: Usunięto

source: Add
pl: Dodaj

# license_plate2
source: license plate
pl: rejestracje

# lecturer2
source: lecturer
pl: wykładowcy

# too_long_val
source: Too long value
pl: Za długa wartość

# too_short_val
source: Too short value
pl: Za krótka wartość

# app_description1
source: The Studentifier App was created to provide better verification of incoming cars.
pl: Aplikacja Studentifier została stworzona aby zapewnić lepszą kontrolę przyjeżdzających samochodów.

# app_description2
source: Also this app can help lecturers to find free parking spaces.
pl: Również ta aplikacja może pomóc wykładowcom w znalezieniu wolnego miejsca parkingowego.

# how_works
source: How it works?
pl: Jak działa?

# app_description3
source: The application scans the license plate of the oncoming car and verify it.
pl: Aplikacja skanuje tablice rejestracyjne nadjeżdżającego samochodu i weryfikuje ją.

# app_description4
source: After approval - the application checks if this license plate belongs to lecturer.
pl: Po zeskanowaniu - aplikacja sprawdza, czy ta tablica rejestracyjna należy do wykładowcy.

# app_description5
source: If belongs - open a gate, but if not - ask for student QR Code.
pl: Jeśli należy - szlaban jest otwierany, zaś jeśli nie - poprosi o kod QR studenta.

# app_description6
source: If student is approved then the gate will open and his data will be added into Data Base.
pl: Jeśli student zostanie zaakceptowany, szlaban zostanie otwarty, a jego dane zostaną dodane do Bazy Danych.

# app_description7
source: But if not verified - then student has access to call to the caretaker.
pl: Ale jeśli nie zostanie zaakceptowany - wtedy uczeń posiadać będzie dostęp do wezwania stróża.

source: Simple, right?
pl: Proste, prawda?

# license_plate3
source: License Plate
pl: Rejestracja

# text_below_license_plate
source: 'Click Accept Button to verify existence of your license plate in the database. If you are registered - the gate will be open. If you are not registered - you will be ask to scan the QR code.
pl: Naciśnij przycisk 'Akceptuj' aby sprawdzić istnienie rejestracji w bazie danych. Jeśli istnieje - wtedy szlaban się podniesie. Jeśli nie - zostaniesz zapytany o skan kodu QR.

source: Accept
pl: Akceptuj

# call_caretaker
source: Call to the caretaker
pl: Zadzwoń po stróża

source: Edit
pl: Edytuj

source: Scanned
pl: zeskanowaną

# license_plate4
source: License plate
pl: Rejestracja

# not_exist_in_db
source: does not exist in database
pl: nie istnieje w bazie danych

# what_wanna_do
source: What do you want to do?
pl: Co zamierzasz zrobić?

# scan_qr
source: Scan the QR code
pl: Zeskanuj kod QR

source: QR scanner
pl: Skaner Kodów QR

# scan_code
source: Scan a QR code!
pl: Zeskanuj kod QR

source: Done
pl: Gotowe

source: Summary
pl: Podsumowanie

# open_gate
source: The gate has been opened!
pl: Szlaban został podniesiony!

# scan_succeeded
source: Thank you for scan!
pl: Dziękuję za skan!

source: Your data
pl: Twoje dane

# summary_icon
source: Click the icon above to return to the home screen
pl: Naciśnij powyższą ikonę aby powrócić do ekranu startowego

source: Student details
pl: Szczegóły studenta

source: First name
pl: Imie

source: Last name
pl: Nazwisko

# num_of_visits_month
source: Visits in last month
pl: Wizyty w miesiącu

# student_id_val
source: Document validity
pl: Ważność dokumentu

# student_id_val2
source: Validity of student ID
pl: Ważność legitymacji studenckiej

source: Edit student
pl: Edytuj studenta

# num_of_visits
source: Number of visits
pl: Ilość wizyt

# enter_dd_mm_yyyy
source: Type date using DD-MM-YYYY format
pl: Wprowadź datę w formacie DD-MM-YYYY

source: Login
pl: Logowanie

# email
source: Email address
pl: Adres email

source: Password
pl: Hasło

# forgot_pass
source: Forgot Password?
pl: Zapomniałeś hasła?

# not_have_account
source: Don't have an account?
pl: Nie masz konta?

# login_btn
source: Login
pl: Zaloguj

# admin_contact
source: Contact to the Administrator
pl: Skontaktuj się z Administratorem

# invalid_email_pass
source: Invalid email or password
pl: Nieprawidłowy email lub hasło

source: Enter email
pl: Wprowadź adres email

source: Enter valid email
pl: Wprowadź prawidłowy adres email

# enter_pass
source: Enter password
pl: Wprowadź hasło

# enter_pass_min6
source: Enter min. 6 characters
pl: Wpisz min. 6 znaków

source: Send email
pl: Wyślij email

source: Sender name
pl: Nazwa nadawcy

source: Subject
pl: Temat

source: Message
pl: Wiadomość

source: Send
pl: Wyślij

source: Sent successfully!
pl: Wysłano pomyślnie!

source: Enter message
pl: Wprowadź wiadomość

source: Enter subject
pl: Wprowadź temat

source: Enter name
pl: Wprowadź nazwę

# camera_permission_req
source: Camera permission required
pl: Wymagane pozwolenie na kamerę

# request_camera
source: Request camera permission
pl: Zezwolenie na kamerę

# enter_correct_date
source: Please enter correct date
pl: Wprowadź poprawną datę

source: Selected date:
pl: Wybrana data:

# parking_limit
source: Car park limit
pl: Limit parkingu

# parking_description
source: Number of available parking spaces for customers
pl: Ilość dostępnych miejsc parkingowych dla konsumentów

# parking_occupancy
source: Car park occupancy
pl: Zajętość parkingu

source: Change limit
pl: Zmień limit

# current_limit
source: The current limit is
pl: Aktualny limit wynosi

source: parking spaces
pl: miejsc parkingowych

source: Invalid value
pl: Niepoprawna wartość

source: Denied entry
pl: Odmowa wjazdu

# rejection_reason
source: Unable to enter due to
pl: Brak możliwości wjazdu z powodu

# parking_spaces_limit
source: the limit of parking spaces
pl: limitu miejsc parkingowych

# invalid_id
source: invalid ID card
pl: nieważnej legitymacji

# home_screen_return
source: Return to the home screen
pl: Powrót na ekran początkowy

# parking_limit2
source: reached parking limit
pl: osiągnięcia limitu parkingu

# limit_exceeded
source: Number of occupied spaces exceeded
pl: Przekroczono ilość zajętych miejsc

source: Reset password
pl: Zrestartuj hasło

# send_code
source: Send recovery code
pl: Wyślij kod odzyskiwania

source: Recover account
pl: Odzyskaj konto

# change_to_recover_code
source: Change to enter recovery code
pl: Zmień, aby wprowadzić kod odzyskiwania

# change_to_send_code
source: Change to send recovery code
pl: Zmień, aby wysłać kod odzyskiwania

source: New password
pl: Nowe hasło

source: Recovery code
pl: Kod odzyskiwania
